app/controllers/comments_controller.rb

  def create
    comment = Comment.new(comment_params)
    comment[:commentable_id] = params[:user_id] ||
                            params[:contact_id] ||
                            params[:contact_share_id]
    comment[:commentable_type] = find_commentable_type
      if comment.save
---
INSERT INTO "comments" ("commentable_id", "commentable_type", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commentable_id", 5], ["commentable_type", "User"], ["content", "jeffrey is coolest"], ["created_at", "2014-10-28 00:15:17.490480"], ["updated_at", "2014-10-28 00:15:17.490480"]]